interface StoryProps {
  storyTexts: string[];
  headerText: string;
  answers: string[];
}

const Storys: StoryProps[] = [
  {
    storyTexts: [
      "ติ๊ง แจ้งเตือนแอพพลิเคชั่น\nโรงหนังชื่อดังดังขึ้น",
      "ว้าว! หนังใหม่ที่สนใจจะฉายวันแรก\nพรุ่งนี้แล้ว สงสัยต้องไปแล้วสิ ไม่อยากโดนสปอยล์ด้วย",
      "ว่าแต่ จะหาคนไปดูด้วยดีไหมนะ",
    ],
    headerText: "หากวันพรุ่งนี้เป็นวันหยุด คุณจะเลือกทำอะไร",
    answers: [
      "ออกไปเที่ยวสิ รออะไร",
      "ต้องปาร์ตี้! เปิดตี้เท่านั้น!!!",
      "อยู่บ้าน ดูหนัง ฟังเพลง พักผ่อนชิว ๆ ดีกว่า",
      "ลองโทรหาเพื่อน ออกไปเดินเล่นห้างง่าย ๆ",
    ],
  },
  {
    storyTexts: [
      "ติ๊ง แจ้งเตือนแอพพลิเคชั่น โรงหนังชื่อดังดังขึ้น",
      "ว้าว! หนังใหม่ที่สนใจจะฉายวันแรก พรุ่งนี้แล้ว สงสัยต้องไปแล้วสิ ไม่อยากโดนสปอยล์ด้วย",
      "ว่าแต่ จะหาคนไปดูด้วยดีไหมนะ",
    ],
    headerText: "หากวันพรุ่งนี้เป็นวันหยุด คุณจะเลือกทำอะไร",
    answers: [
      "ออกไปเที่ยวสิ รออะไร",
      "ต้องปาร์ตี้! เปิดตี้เท่านั้น!!!",
      "อยู่บ้าน ดูหนัง ฟังเพลง พักผ่อนชิว ๆ ดีกว่า",
      "ลองโทรหาเพื่อน ออกไปเดินเล่นห้างง่าย ๆ",
    ],
  }
];


export default Storys;
