import Dc3 from "@/assets/download-share/แมวดำ.png";
import Dc5 from "@/assets/download-share/แมววิเชียรมาศ.png";
import Dc4 from "@/assets/download-share/แมวศุภลักษณ์.png";
import Dc7 from "@/assets/download-share/แมวสลิด.png";
import Dc1 from "@/assets/download-share/แมวสามสี.png";
import Dc6 from "@/assets/download-share/แมวส้ม.png";
import Dc2 from "@/assets/download-share/แมวเปรอะ.png";
import Cat1 from "@/assets/game/ResultImage/ANS-1-แมวสามสี.jpg";
import Cat2 from "@/assets/game/ResultImage/ANS-2-แมวเปรอะ.jpg";
import Cat3 from "@/assets/game/ResultImage/ANS-3-แมวดำ.jpg";
import Cat4 from "@/assets/game/ResultImage/ANS-4-แมวศุภลักษณ์.jpg";
import Cat5 from "@/assets/game/ResultImage/ANS-5-แมววิเชียรมาศ.jpg";
import Cat6 from "@/assets/game/ResultImage/ANS-6-แมวส้ม.jpg";
import Cat7 from "@/assets/game/ResultImage/ANS-7-แมวสลิด.jpg";

interface ResultProps {
  role: string;
  image: string;
  dsImage: string;
  text: string;
}

const Results: ResultProps[] = [
  {
    role: "แมวสามสี",
    image: Cat1,
    dsImage: Dc1,
    text: "คุณเป็นคนที่มีโลกส่วนตัวสูง ถึงแม้จะมีเพื่อนเยอะขนาดไหนก็ตาม แต่จริงๆแล้วชอบอยู่คนเดียว ไม่ชอบความวุ่นวาย จึงมีนิสัยที่เหมือนแมวสามสี เพราะ แมวสีเหล่านี้ส่วนใหญ่แล้วจะชอบอยู่ในมุมโปรดที่สามารถทำอะไรเงียบๆตามลำพังคนเดียวได้",
  },
  {
    role: "แมวเปรอะ",
    image: Cat2,
    dsImage: Dc2,
    text: "แม้ว่าคุณจะมีบุคลิกภายนอกที่อาจจะดูดุๆ เหวี่่ยงๆ แต่ถ้าใครลองเข้ามาทำความรู้จักกับคุณแล้ว ต่างพูดเป็นเสียงเดียวกันว่าคุณเป็นคนที่ค่อนข้างเฟรนลี่ เอาใจคนอื่นเก่ง  จึงมีนิสัยเหมือนแมวเปรอะ เพราะ แมวสีนี้ส่วนใหญ่จะมีนิสัยขี้เล่น ชอบเข้าหาและอ้อนคนได้เก่งมากเป็นพิเศษ",
  },
  {
    role: "แมวดำ",
    image: Cat3,
    dsImage: Dc3,
    text: "คุณอาจดูเป็นคนเย่อหยิ่ง วางตัวเป็นผู่ใหญ่ เชื่อมั่นในความคิดของตัวเอง แต่คุณก็มีมุมที่ตรงข้ามกันอยู่เหมือนกันนนะ เมื่อยู่กับเพื่อนสนิท หรือครอบครัว คุณจะกลายเป็นคนที่คุยเก่ง ร่าเริง เหมือนเป็นคนละคนเลย จึงมีนิสัยเหมือนกับแมวดำ เพราะ แมวสีเหล่านี้เป็นแมวที่ฉลาด มีความมั่นใจในตัวเอง และเป็นแมวขี้เล่นมาก มันจะมีความสุขถ้าเจ้าของมีเวลาเล่นไปกับมันได้",
  },
  {
    role: "แมวศุภลักษณ์",
    image: Cat4,
    dsImage: Dc4,
    text: "คุณเป็นคนที่ใส่ใจในรายละเอียดเล็กๆน้อยๆ เป็นคนขี้สงสัย ชอบตั้งคำถาม และพยายามหาจนได้ในที่สุด จึงมีนิสัยเหมือนแมวศุภลักษณ์ เพราะ แมวสีน้ำตาลเหล่านี้ส่วนใหญ่แล้วจะมีนิสัยที่ขี้สงสัยมากเป็นพิเศษ ได้ยินเสียง หรือจะอะไรเคลื่อนไหวเล็กน้อยก็มักจะสงสัยและพุ่งเข้าหาเลย",
  },
  {
    role: "แมววิเชียรมาศ",
    image: Cat5,
    dsImage: Dc5,
    text: "คุณเป็นคนเก่ง มีไหวพริบ ช่างพูดช่างคุย และมีมุมอ่อนโยน ต้องการคนมาดูแล เอาใจใส่ คลายเหงา จึงมีนิสัยเหมือนแมววิเชียรมาศ เพราะ มีความเฉลียวฉลาด ขี้อ้อน คุยเก่ง แถมยังติดเจ้าของมากเป็นพิเศษ ต้องการความรัก ความเอาใจใส่จากเจ้าของ เดินตามเจ้าของเป็นเงาตามตัวเลยทีเดียว",
  },
  {
    role: "แมวส้ม",
    image: Cat6,
    dsImage: Dc6,
    text: "คุณเป็นคนที่มีภาวะความเป็นผู้นำและมีความเชื่อมั่นในตัวเองสูง เป็นคนที่มีเพื่อนเยอะมากๆ แม้ภายนอกจะดูเฟรนลี่ แต่ก็แอบมีกำแพงนิดนึงเพื่อป้องกันตัวเองไม่ให้ตัวเองผิดหวัง จึงมีนิสัยเหมือนแมวส้ม เพราะ แมวสีเหล่านี้ส่วนใหญ่จะเป็นแมวที่มีความเป็นมิตร ขี้อ้อน ชอบเป็นหัวหน้าแก๊ง มีความเป็นตัวของตัวเองสูง ทำให้ไม่ชอบที่จะตามใจใคร แต่จะชอบตามใจตัวเอง อยากมาหาก็จะมาหาเองแล้วแต่อารมณ์",
  },
  {
    role: "แมวสลิด",
    image: Cat7,
    dsImage: Dc7,
    text: "คุณเป็นคนมองโลกในแง่ดี คิดบวก เป็นคนจริงใจกับความรู้สึกของตัวเอง แต่ก็มีอีกมุมนึงที่คุณชอบเข้าสังคม ไม่เคยพลาดพลาดงานสำคัญต่างๆ พร้อมลุยทุกเรื่องแบบที่ไม่กลัวอะไรเลย จึงมีนิสัยเหมือนแมวสลิด เพราะ แมวสีเหล่านี้เข้ากับแมวตัวอื่นๆได้ดี นิสัยเป็นมิตร ขี้อ้อน ต้องการความรักความเอาใจใส่",
  },
];

export default Results;
