import img1_1 from "../assets/game/StoryIcons/1/1.png"
import img1_2 from "../assets/game/StoryIcons/1/2.png"
import img1_3 from "../assets/game/StoryIcons/1/3.png"
import img2_1 from "../assets/game/StoryIcons/2/1.png"
import img2_2 from "../assets/game/StoryIcons/2/2.png"
import img2_3 from "../assets/game/StoryIcons/2/3.png"
import img2_4 from "../assets/game/StoryIcons/2/4.png"
import img3_1 from "../assets/game/StoryIcons/3/1.png"
import img3_2 from "../assets/game/StoryIcons/3/2.png"
import img4_1 from "../assets/game/StoryIcons/4/1.png"
import img5_1 from "../assets/game/StoryIcons/5/1.png"
import img5_2 from "../assets/game/StoryIcons/5/2.png"
import img6_1 from "../assets/game/StoryIcons/6/1.png"
import img7_1 from "../assets/game/StoryIcons/7/1.png"
interface StoryProps {
  text: string,
  icon: string
}

interface GameStoryProps {
  question: string;
  answers: string[];
  answerScores: number[];
  story: StoryProps[];
}

const GameStorys: GameStoryProps[] = [
  {
    question: "หากวันพรุ่งนี้เป็นวันหยุด คุณจะเลือกทำอะไร",
    answers: [
      "ออกไปเที่ยวสิ รออะไร",
      "ต้องปาร์ตี้! เปิดตี้เท่านั้น!!!",
      "อยู่บ้าน ดูหนัง ฟังเพลง พักผ่อนชิว ๆ ดีกว่า",
      "ลองโทรหาเพื่อน ออกไปเดินเล่นห้างง่าย ๆ",
    ],
    answerScores: [1, 3, 4, 2],
    story: [
      {
        text: "ติ๊ง แจ้งเตือนแอพพลิเคชั่น\nโรงหนังชื่อดังดังขึ้น",
        icon: img1_1
      },{
        text: "ว้าว! หนังใหม่ที่สนใจจะฉายวันแรก\nพรุ่งนี้แล้ว สงสัยต้องไปแล้วสิ ไม่อยากโดนสปอยล์ด้วย",
        icon: img1_2
      },{
        text: "ว่าแต่ จะหาคนไปดูด้วยดีไหมนะ",
        icon: img1_3
      }
    ]
  },
  {
    question: "หากอยากไปดูหนังที่เพิ่งออกใหม่ คุณจะเลือกชวนใครไป",
    answers: [
      "ใครก็ได้ หาเพื่อนใหม่เอาหน้างานละกัน",
      "ไม่เพื่อนสนิ้ททท ก็ครอบครัวหน่ะสิ",
      "ขอไปดูคนเดียวดีกว่า ไม่ต้องวุ่นวาย",
      "แค่รู้จักกัน จะใครก็ได้ทั้งนั้นแหละ",
    ],
    answerScores: [4, 2, 1, 3],
    story: [
      {
        text: "ส่วนวันนี้เพิ่งทำงานเสร็จ\nนอนพักผ่อน เล่นโทรศัพท์ดีกว่า",
        icon: img2_1
      },{
        text: "ตริ้ง* เสียงโทรศัพท์ดังขึ้น",
        icon: img2_2
      },{
        text: "เพื่อนทักแชทมาว่า\n“แก มันมีเกมทดสอบใหม่ ลองเล่นไหม”",
        icon: img2_3
      },{
        text: "*กดลิงค์*\nเล่นเกมไปสักพัก",
        icon: img2_4
      }
    ]
  },
  {
    question: "คนรอบข้างบอกคุณว่า คุณเป็นคนอย่างไร",
    answers: [
      "เป็นคนเปิดเผย ร่าเริงและคุยเก่งมากอยู่แล้ว และจริงๆก็เป็นแบบนี้นี่แหละ",
      "เฟรนลี่มาก ๆ ถ้าเดินไปเจอคนไม่รู้จักก็สามารถคุยเป็นตุเป็นตะได้เสมอ",
      "ภายนอกดูเงียบๆ เก็บตัว แต่จริงๆแล้วร่าเริงและคุยเก่งมาก",
      "ภายนอกดูเหวี่ยงๆ แต่จริงๆแล้วนิสัยดีและเป็นกันเองมาก",
    ],
    answerScores: [3, 4, 2, 1],
    story: [
      {
        text: "55555 (ขำ) สนุกจังเลย ไหนลองเล่นต่อซิ",
        icon: img3_1
      },{
        text: "ทันใดนั้น *แกร๊ก* *ครืนนนน*",
        icon: img3_2
      }
    ]
  },
  {
    question: "หากคุณได้ยินเสียงอะไรแปลกๆ มาจากข้างนอก คุณจะทำอย่างไร",
    answers: [
      "ไม่น่ามีอะไรมั้ง ช่างมันเถอะ",
      "เดินออกไปดูอย่างไว",
      "ถ่ายลงสตอรี่ก่อน ค่อยเดินไปดู สร้างคอนเท้นนิดนึง",
      "ลองโทรหาเพื่อน หาเพื่อนเดินไปดูด้วย",
    ],
    answerScores: [2, 1, 4, 3],
    story: [
      {
        text: "กลับมาเล่นเกมต่อดีกว่า",
        icon: img4_1
      }
    ]
  },
  {
    question:
      "ช่วงเวลาพักทานอาหารมื้อเที่ยง หากต้องคิดว่าจะไปทานร้านไหน ใครในกลุ่มมักจะเป็นคนตัดสินใจ",
    answers: [
      "ตัวเองนี่แหละ",
      "เพื่อน ๆ ในกลุ่ม",
      "ร้านไหนคนเยอะ ดูน่ากินก็เข้าเลยยย",
      "ใครอยากกินอะไร ก็มาโหวตกัน",
    ],
    answerScores: [1, 4, 3, 2],
    story: [
      {
        text: "อื้อ หือ เป็นคำถามที่เลือกตอบยาก\nเหมือนกันนะเนี่ย",
        icon: img5_1
      },{
        text: "ไหนมาดูข้อต่อไปสิว่า\nจะโหดขนาดไหน",
        icon: img5_2
      }
    ]
  },
  {
    question: "เวลาเล่นกันในแก๊งเพื่อน คุณมักจะเป็นคนประเภทไหน",
    answers: [
      "เป็นฝ่ายไปแกล้งคนอื่นเขาหน่ะสิ พอได้แกล้งคนอื่นแล้วมันสนุกดีนี่",
      "โดนแกล้งตลอดเลยย ไม่รู้ทำไม แล้วดันแกล้งกลับไม่ได้ด้วยนี่สิ เศร้าเลย",
      "เป็นฝ่ายสมทบกับคนแกล้งหล่ะมั้ง ไม่ได้เริ่มเอง แต่ขอตามน้ำไปแระกัน มันก็ดูสนุกดีอ่ะ",
      "โดนแกล้งบ่อยอยู่นะ แต่ก็เอาคืนตลอดจ้าา ไม่ยอมโดนอยู่ฝ่ายเดียวหรอก",
    ],
    answerScores: [4, 1, 3, 2],
    story: [
      {
        text: "เอาล่ะ เหลือข้อสุดท้ายแล้วสินะ",
        icon: img6_1
      }
    ]
  },
  {
    question: "ถ้าหากว่างๆแล้วอยากเปิดเพลงฟัง คุณจะเลือกฟังเพลงแนวไหน",
    answers: [
      "แนว Rock ดีกว่า ดนตรีมันดี",
      "ยุคนี้มันต้อง T-POP, K-POP แล้วป่าวว ",
      "แนวเบาๆ ชิวๆ สบายๆ แบบ R&B หล่ะมั้งง",
      "ยังไงก็ต้อง Rap อยู่แล้ว เปิดสงคราม rap กับเพื่อนหรือจะฟังคนเดียวยังไงก็มัน",
    ],
    answerScores: [2, 3, 1, 4],
    story: [
      {
        text: "เล่นเสร็จสักที",
        icon: img7_1
      }
    ]
  },
];

export default GameStorys;
