interface StoryProps {
  headerText: string;
  answers: string[];
  answerScores: number[];
  storyTexts: string[];
}

const Storys: StoryProps[] = [
  {
    headerText: "หากวันพรุ่งนี้เป็นวันหยุด คุณจะเลือกทำอะไร",
    answers: [
      "ออกไปเที่ยวสิ รออะไร",
      "ต้องปาร์ตี้! เปิดตี้เท่านั้น!!!",
      "อยู่บ้าน ดูหนัง ฟังเพลง พักผ่อนชิว ๆ ดีกว่า",
      "ลองโทรหาเพื่อน ออกไปเดินเล่นห้างง่าย ๆ",
    ],
    answerScores: [1, 2, 3, 4],
    storyTexts: [
      "ติ๊ง แจ้งเตือนแอพพลิเคชั่น\nโรงหนังชื่อดังดังขึ้น",
      "ว้าว! หนังใหม่ที่สนใจจะฉายวันแรก\nพรุ่งนี้แล้ว สงสัยต้องไปแล้วสิ ไม่อยากโดนสปอยล์ด้วย",
      "ว่าแต่ จะหาคนไปดูด้วยดีไหมนะ",
    ],
  },
  {
    headerText: "หากอยากไปดูหนังที่เพิ่งออกใหม่ คุณจะเลือกชวนใครไป",
    answers: [
      "ใครก็ได้ หาเพื่อนใหม่เอาหน้างานละกัน",
      "ไม่เพื่อนสนิ้ททท ก็ครอบครัวหน่ะสิ",
      "ขอไปดูคนเดียวดีกว่า ไม่ต้องวุ่นวาย",
      "แค่รู้จักกัน จะใครก็ได้ทั้งนั้นแหละ",
    ],
    answerScores: [1, 2, 3, 4],
    storyTexts: [
      "ส่วนวันนี้เพิ่งทำงานเสร็จ\nนอนพักผ่อน เล่นโทรศัพท์ดีกว่า",
      "ตริ้ง* เสียงโทรศัพท์ดังขึ้น",
      "เพื่อนทักแชทมาว่า\n“แก มันมีเกมทดสอบใหม่ ลองเล่นไหม”",
      "*กดลิงค์*\nเล่นเกมไปสักพัก",
    ],
  },
  {
    headerText: "คนรอบข้างบอกคุณว่า คุณเป็นคนอย่างไร",
    answers: [
      "เป็นคนเปิดเผย ร่าเริงและคุยเก่งมากอยู่แล้ว และจริงๆก็เป็นแบบนี้นี่แหละ",
      "เฟรนลี่มาก ๆ ถ้าเดินไปเจอคนไม่รู้จักก็สามารถคุยเป็นตุเป็นตะได้เสมอ",
      "ภายนอกดูเงียบๆ เก็บตัว แต่จริงๆแล้วร่าเริงและคุยเก่งมาก",
      "ภายนอกดูเหวี่ยงๆ แต่จริงๆแล้วนิสัยดีและเป็นกันเองมาก",
    ],
    answerScores: [1, 2, 3, 4],
    storyTexts: [
      "55555 (ขำ) สนุกจังเลย ไหนลองเล่นต่อซิ",
      "ทันใดนั้น *แกร๊ก* *ครืนนนน*",
    ],
  },
  {
    headerText: "หากคุณได้ยินเสียงอะไรแปลกๆ มาจากข้างนอก คุณจะทำอย่างไร",
    answers: [
      "ไม่น่ามีอะไรมั้ง ช่างมันเถอะ",
      "เดินออกไปดูอย่างไว",
      "ถ่ายลงสตอรี่ก่อน ค่อยเดินไปดู สร้างคอนเท้นนิดนึง",
      "ลองโทรหาเพื่อน หาเพื่อนเดินไปดูด้วย",
    ],
    answerScores: [1, 2, 3, 4],
    storyTexts: ["กลับมาเล่นเกมต่อดีกว่า"],
  },
  {
    headerText:
      "ช่วงเวลาพักทานอาหารมื้อเที่ยง หากต้องคิดว่าจะไปทานร้านไหน ใครในกลุ่มมักจะเป็นคนตัดสินใจ",
    answers: [
      "ตัวเองนี่แหละ",
      "เพื่อน ๆ ในกลุ่ม",
      "ร้านไหนคนเยอะ ดูน่ากินก็เข้าเลยยย",
      "ใครอยากกินอะไร ก็มาโหวตกัน",
    ],
    answerScores: [1, 2, 3, 4],
    storyTexts: [
      "อื้อ หือ เป็นคำถามที่เลือกตอบยาก\nเหมือนกันนะเนี่ย",
      "ไหนมาดูข้อต่อไปสิว่า\nจะโหดขนาดไหน",
    ],
  },
  {
    headerText: "เวลาเล่นกันในแก๊งเพื่อน คุณมักจะเป็นคนประเภทไหน",
    answers: [
      "เป็นฝ่ายไปแกล้งคนอื่นเขาหน่ะสิ พอได้แกล้งคนอื่นแล้วมันสนุกดีนี่",
      "โดนแกล้งตลอดเลยย ไม่รู้ทำไม แล้วดันแกล้งกลับไม่ได้ด้วยนี่สิ เศร้าเลย",
      "เป็นฝ่ายสมทบกับคนแกล้งหล่ะมั้ง ไม่ได้เริ่มเอง แต่ขอตามน้ำไปแระกัน มันก็ดูสนุกดีอ่ะ",
      "โดนแกล้งบ่อยอยู่นะ แต่ก็เอาคืนตลอดจ้าา ไม่ยอมโดนอยู่ฝ่ายเดียวหรอก",
    ],
    answerScores: [1, 2, 3, 4],
    storyTexts: ["เอาล่ะ เหลือข้อสุดท้ายแล้วสินะ"],
  },
  {
    headerText: "ถ้าหากว่างๆแล้วอยากเปิดเพลงฟัง คุณจะเลือกฟังเพลงแนวไหน",
    answers: [
      "แนว Rock ดีกว่า ดนตรีมันดี",
      "ยุคนี้มันต้อง T-POP, K-POP แล้วป่าวว ",
      "แนวเบาๆ ชิวๆ สบายๆ แบบ R&B หล่ะมั้งง",
      "ยังไงก็ต้อง Rap อยู่แล้ว เปิดสงคราม rap กับเพื่อนหรือจะฟังคนเดียวยังไงก็มัน",
    ],
    answerScores: [1, 2, 3, 4],
    storyTexts: ["เล่นเสร็จสักที"],
  },
];

export default Storys;
